
#### Terraform Format and Style: `success`
#### Terraform Initialization: `success`
#### Terraform Validation: `success`
#### Terraform Plan: `success`

<details>
<summary>Show Plan</summary>

```

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  ~ update in-place

Terraform will perform the following actions:

  # github_actions_organization_permissions.main will be created
  + resource "github_actions_organization_permissions" "main" {
      + allowed_actions      = "selected"
      + enabled_repositories = "all"
      + id                   = (known after apply)

      + allowed_actions_config {
          + github_owned_allowed = true
          + patterns_allowed     = [
              + "jurplel/install-qt-action@v3, jurplel/install-qt-action/action@v3",
            ]
          + verified_allowed     = true
        }
    }

  # github_organization_settings.organization will be updated in-place
  ~ resource "github_organization_settings" "organization" {
      ~ advanced_security_enabled_for_new_repositories               = false -> true
        id                                                           = "shishifubing"
      ~ secret_scanning_push_protection_enabled_for_new_repositories = false -> true
        # (21 unchanged attributes hidden)
    }

  # gitlab_project.repositories[".github"] will be created
  + resource "gitlab_project" "repositories" {
      + allow_merge_on_skipped_pipeline                  = (known after apply)
      + analytics_access_level                           = (known after apply)
      + auto_cancel_pending_pipelines                    = (known after apply)
      + auto_devops_deploy_strategy                      = (known after apply)
      + auto_devops_enabled                              = (known after apply)
      + autoclose_referenced_issues                      = (known after apply)
      + avatar_hash                                      = (known after apply)
      + avatar_url                                       = (known after apply)
      + build_git_strategy                               = (known after apply)
      + build_timeout                                    = (known after apply)
      + builds_access_level                              = (known after apply)
      + ci_default_git_depth                             = (known after apply)
      + ci_forward_deployment_enabled                    = (known after apply)
      + ci_separated_caches                              = (known after apply)
      + container_registry_access_level                  = (known after apply)
      + container_registry_enabled                       = (known after apply)
      + default_branch                                   = (known after apply)
      + description                                      = (known after apply)
      + forking_access_level                             = (known after apply)
      + http_url_to_repo                                 = (known after apply)
      + id                                               = (known after apply)
      + import_url                                       = "https://github.com/shishifubing/.github.git"
      + issues_access_level                              = (known after apply)
      + issues_enabled                                   = (known after apply)
      + lfs_enabled                                      = (known after apply)
      + merge_method                                     = (known after apply)
      + merge_pipelines_enabled                          = (known after apply)
      + merge_requests_access_level                      = (known after apply)
      + merge_requests_enabled                           = (known after apply)
      + merge_trains_enabled                             = (known after apply)
      + mirror_overwrites_diverged_branches              = (known after apply)
      + mirror_trigger_builds                            = (known after apply)
      + name                                             = "dot-github"
      + namespace_id                                     = 13807091
      + only_allow_merge_if_all_discussions_are_resolved = (known after apply)
      + only_allow_merge_if_pipeline_succeeds            = (known after apply)
      + only_mirror_protected_branches                   = (known after apply)
      + operations_access_level                          = (known after apply)
      + packages_enabled                                 = (known after apply)
      + pages_access_level                               = (known after apply)
      + path_with_namespace                              = (known after apply)
      + pipelines_enabled                                = (known after apply)
      + printing_merge_request_link_enabled              = (known after apply)
      + public_builds                                    = (known after apply)
      + remove_source_branch_after_merge                 = (known after apply)
      + repository_access_level                          = (known after apply)
      + repository_storage                               = (known after apply)
      + request_access_enabled                           = (known after apply)
      + requirements_access_level                        = (known after apply)
      + runners_token                                    = (sensitive value)
      + security_and_compliance_access_level             = (known after apply)
      + shared_runners_enabled                           = (known after apply)
      + snippets_access_level                            = (known after apply)
      + snippets_enabled                                 = (known after apply)
      + squash_option                                    = (known after apply)
      + ssh_url_to_repo                                  = (known after apply)
      + tags                                             = (known after apply)
      + topics                                           = [
          + "readme",
          + "readme-profile",
          + "shishifubing",
        ]
      + visibility_level                                 = "public"
      + web_url                                          = (known after apply)
      + wiki_access_level                                = (known after apply)
      + wiki_enabled                                     = (known after apply)

      + container_expiration_policy {
          + cadence           = (known after apply)
          + enabled           = (known after apply)
          + keep_n            = (known after apply)
          + name_regex_delete = (known after apply)
          + name_regex_keep   = (known after apply)
          + next_run_at       = (known after apply)
          + older_than        = (known after apply)
        }

      + push_rules {
          + author_email_regex            = (known after apply)
          + branch_name_regex             = (known after apply)
          + commit_committer_check        = (known after apply)
          + commit_message_negative_regex = (known after apply)
          + commit_message_regex          = (known after apply)
          + deny_delete_tag               = (known after apply)
          + file_name_regex               = (known after apply)
          + max_file_size                 = (known after apply)
          + member_check                  = (known after apply)
          + prevent_secrets               = (known after apply)
          + reject_unsigned_commits       = (known after apply)
        }
    }

  # time_rotating.day will be created
  + resource "time_rotating" "day" {
      + day              = (known after apply)
      + hour             = (known after apply)
      + id               = (known after apply)
      + minute           = (known after apply)
      + month            = (known after apply)
      + rfc3339          = (known after apply)
      + rotation_days    = 1
      + rotation_rfc3339 = (known after apply)
      + second           = (known after apply)
      + unix             = (known after apply)
      + year             = (known after apply)
    }

  # time_static.day will be created
  + resource "time_static" "day" {
      + day     = (known after apply)
      + hour    = (known after apply)
      + id      = (known after apply)
      + minute  = (known after apply)
      + month   = (known after apply)
      + rfc3339 = (known after apply)
      + second  = (known after apply)
      + unix    = (known after apply)
      + year    = (known after apply)
    }

  # module.repositories[".github"].github_repository.repository will be updated in-place
  ~ resource "github_repository" "repository" {
      + archive_on_destroy                      = true
      ~ auto_init                               = false -> true
      + gitignore_template                      = "Python"
        id                                      = ".github"
      + ignore_vulnerability_alerts_during_read = false
      + license_template                        = "agpl-3.0"
        name                                    = ".github"
        # (33 unchanged attributes hidden)

      ~ security_and_analysis {
          ~ advanced_security {
              + status = "enabled"
            }

          ~ secret_scanning_push_protection {
              ~ status = "disabled" -> "enabled"
            }

            # (1 unchanged block hidden)
        }
    }

  # module.repositories["app-android-anki-chinese-flashcards-enricher"].github_repository.repository will be updated in-place
  ~ resource "github_repository" "repository" {
      + archive_on_destroy                      = true
      ~ auto_init                               = false -> true
      + gitignore_template                      = "Python"
        id                                      = "app-android-anki-chinese-flashcards-enricher"
      + ignore_vulnerability_alerts_during_read = false
      + license_template                        = "agpl-3.0"
        name                                    = "app-android-anki-chinese-flashcards-enricher"
      ~ topics                                  = [
          + "android",
          + "app",
          + "kotlin",
            # (1 unchanged element hidden)
        ]
        # (32 unchanged attributes hidden)

      ~ security_and_analysis {
          ~ advanced_security {
              + status = "enabled"
            }

          ~ secret_scanning_push_protection {
              ~ status = "disabled" -> "enabled"
            }

            # (1 unchanged block hidden)
        }
    }

  # module.repositories["app-cli-autoscroll"].github_repository.repository will be updated in-place
  ~ resource "github_repository" "repository" {
      + archive_on_destroy                      = true
      ~ auto_init                               = false -> true
      + gitignore_template                      = "Python"
        id                                      = "app-cli-autoscroll"
      + ignore_vulnerability_alerts_during_read = false
      + license_template                        = "agpl-3.0"
        name                                    = "app-cli-autoscroll"
        # (33 unchanged attributes hidden)

      ~ security_and_analysis {
          ~ advanced_security {
              + status = "enabled"
            }

          ~ secret_scanning_push_protection {
              ~ status = "disabled" -> "enabled"
            }

            # (1 unchanged block hidden)
        }
    }

  # module.repositories["app-desktop-useless-cpp-gui"].github_repository.repository will be updated in-place
  ~ resource "github_repository" "repository" {
      + archive_on_destroy                      = true
      ~ auto_init                               = false -> true
      + gitignore_template                      = "Python"
        id                                      = "app-desktop-useless-cpp-gui"
      + ignore_vulnerability_alerts_during_read = false
      + license_template                        = "agpl-3.0"
        name                                    = "app-desktop-useless-cpp-gui"
      ~ topics                                  = [
          + "ci",
          - "cicd",
            # (9 unchanged elements hidden)
        ]
        # (32 unchanged attributes hidden)

      ~ security_and_analysis {
          ~ advanced_security {
              + status = "enabled"
            }

          ~ secret_scanning_push_protection {
              ~ status = "disabled" -> "enabled"
            }

            # (1 unchanged block hidden)
        }
    }

  # module.repositories["app-web-crawler-book-creator"].github_repository.repository will be updated in-place
  ~ resource "github_repository" "repository" {
      + archive_on_destroy                      = true
      ~ auto_init                               = false -> true
      + gitignore_template                      = "Python"
        id                                      = "app-web-crawler-book-creator"
      + ignore_vulnerability_alerts_during_read = false
      + license_template                        = "agpl-3.0"
        name                                    = "app-web-crawler-book-creator"
      ~ vulnerability_alerts                    = false -> true
        # (32 unchanged attributes hidden)

      ~ security_and_analysis {
          ~ advanced_security {
              + status = "enabled"
            }

          ~ secret_scanning_push_protection {
              ~ status = "disabled" -> "enabled"
            }

            # (1 unchanged block hidden)
        }
    }

  # module.repositories["app-web-django-assignment"].github_repository.repository will be updated in-place
  ~ resource "github_repository" "repository" {
      + archive_on_destroy                      = true
      ~ auto_init                               = false -> true
      + gitignore_template                      = "Python"
        id                                      = "app-web-django-assignment"
      + ignore_vulnerability_alerts_during_read = false
      + license_template                        = "agpl-3.0"
        name                                    = "app-web-django-assignment"
      ~ vulnerability_alerts                    = false -> true
        # (32 unchanged attributes hidden)

      ~ security_and_analysis {
          ~ advanced_security {
              + status = "enabled"
            }

          ~ secret_scanning_push_protection {
              ~ status = "disabled" -> "enabled"
            }

            # (1 unchanged block hidden)
        }
    }

  # module.repositories["app-web-tianyi"].github_repository.repository will be updated in-place
  ~ resource "github_repository" "repository" {
      + archive_on_destroy                      = true
      ~ auto_init                               = false -> true
      + gitignore_template                      = "Python"
        id                                      = "app-web-tianyi"
      + ignore_vulnerability_alerts_during_read = false
      + license_template                        = "agpl-3.0"
        name                                    = "app-web-tianyi"
      ~ vulnerability_alerts                    = false -> true
        # (32 unchanged attributes hidden)

      ~ security_and_analysis {
          ~ advanced_security {
              + status = "enabled"
            }

          ~ secret_scanning_push_protection {
              ~ status = "disabled" -> "enabled"
            }

            # (1 unchanged block hidden)
        }
    }

  # module.repositories["ci-actions-common"].github_repository.repository will be updated in-place
  ~ resource "github_repository" "repository" {
      + archive_on_destroy                      = true
      ~ auto_init                               = false -> true
      + gitignore_template                      = "Python"
        id                                      = "ci-actions-common"
      + ignore_vulnerability_alerts_during_read = false
      + license_template                        = "agpl-3.0"
        name                                    = "ci-actions-common"
        # (33 unchanged attributes hidden)

      ~ security_and_analysis {
          ~ advanced_security {
              + status = "enabled"
            }

          ~ secret_scanning_push_protection {
              ~ status = "disabled" -> "enabled"
            }

            # (1 unchanged block hidden)
        }

      - template {
          - include_all_branches = false -> null
          - owner                = "shishifubing" -> null
          - repository           = "template-repository-default" -> null
        }
    }

  # module.repositories["infra-cloud-shishifubing.com"].github_repository.repository will be updated in-place
  ~ resource "github_repository" "repository" {
      + archive_on_destroy                      = true
      ~ auto_init                               = false -> true
      + gitignore_template                      = "Python"
        id                                      = "infra-cloud-shishifubing.com"
      + ignore_vulnerability_alerts_during_read = false
      + license_template                        = "agpl-3.0"
        name                                    = "infra-cloud-shishifubing.com"
        # (33 unchanged attributes hidden)

      ~ security_and_analysis {
          ~ advanced_security {
              + status = "enabled"
            }

          ~ secret_scanning_push_protection {
              ~ status = "disabled" -> "enabled"
            }

            # (1 unchanged block hidden)
        }
    }

  # module.repositories["infra-repos-shishifubing"].github_repository.repository will be updated in-place
  ~ resource "github_repository" "repository" {
      + archive_on_destroy                      = true
      ~ auto_init                               = false -> true
      + gitignore_template                      = "Python"
        id                                      = "infra-repos-shishifubing"
      + ignore_vulnerability_alerts_during_read = false
      + license_template                        = "agpl-3.0"
        name                                    = "infra-repos-shishifubing"
        # (33 unchanged attributes hidden)

      ~ security_and_analysis {
          ~ advanced_security {
              + status = "enabled"
            }

          ~ secret_scanning_push_protection {
              ~ status = "disabled" -> "enabled"
            }

            # (1 unchanged block hidden)
        }
    }

  # module.repositories["misc-personal-dotfiles"].github_repository.repository will be updated in-place
  ~ resource "github_repository" "repository" {
      + archive_on_destroy                      = true
      ~ auto_init                               = false -> true
      + gitignore_template                      = "Python"
        id                                      = "misc-personal-dotfiles"
      + ignore_vulnerability_alerts_during_read = false
      + license_template                        = "agpl-3.0"
        name                                    = "misc-personal-dotfiles"
        # (33 unchanged attributes hidden)

      ~ security_and_analysis {
          ~ advanced_security {
              + status = "enabled"
            }

          ~ secret_scanning_push_protection {
              ~ status = "disabled" -> "enabled"
            }

            # (1 unchanged block hidden)
        }
    }

  # module.repositories["plugin-firefox-new-tab-bookmarks"].github_repository.repository will be updated in-place
  ~ resource "github_repository" "repository" {
      + archive_on_destroy                      = true
      ~ auto_init                               = false -> true
      + gitignore_template                      = "Python"
        id                                      = "plugin-firefox-new-tab-bookmarks"
      + ignore_vulnerability_alerts_during_read = false
      + license_template                        = "agpl-3.0"
        name                                    = "plugin-firefox-new-tab-bookmarks"
      ~ topics                                  = [
          + "css",
          + "css3",
          + "html",
          + "html5",
            # (6 unchanged elements hidden)
        ]
        # (32 unchanged attributes hidden)

      ~ security_and_analysis {
          ~ advanced_security {
              + status = "enabled"
            }

          ~ secret_scanning_push_protection {
              ~ status = "disabled" -> "enabled"
            }

            # (1 unchanged block hidden)
        }
    }

  # module.repositories["plugin-sonatype-nexus-security-check"].github_repository.repository will be updated in-place
  ~ resource "github_repository" "repository" {
      + archive_on_destroy                      = true
      ~ auto_init                               = false -> true
      + gitignore_template                      = "Python"
        id                                      = "plugin-sonatype-nexus-security-check"
      + ignore_vulnerability_alerts_during_read = false
      + license_template                        = "agpl-3.0"
        name                                    = "plugin-sonatype-nexus-security-check"
      ~ vulnerability_alerts                    = false -> true
        # (32 unchanged attributes hidden)

      ~ security_and_analysis {
          ~ advanced_security {
              + status = "enabled"
            }

          ~ secret_scanning_push_protection {
              ~ status = "disabled" -> "enabled"
            }

            # (1 unchanged block hidden)
        }
    }

  # module.repositories["shishifubing.github.io"].github_repository.repository will be updated in-place
  ~ resource "github_repository" "repository" {
      + archive_on_destroy                      = true
      ~ auto_init                               = false -> true
      + gitignore_template                      = "Python"
        id                                      = "shishifubing.github.io"
      + ignore_vulnerability_alerts_during_read = false
      + license_template                        = "agpl-3.0"
        name                                    = "shishifubing.github.io"
      ~ topics                                  = [
          + "github-pages",
            # (2 unchanged elements hidden)
        ]
        # (32 unchanged attributes hidden)

      ~ security_and_analysis {
          ~ advanced_security {
              + status = "enabled"
            }

          ~ secret_scanning_push_protection {
              ~ status = "disabled" -> "enabled"
            }

            # (1 unchanged block hidden)
        }

        # (1 unchanged block hidden)
    }

  # module.repositories["snippets-golang-leetcode"].github_repository.repository will be updated in-place
  ~ resource "github_repository" "repository" {
      + archive_on_destroy                      = true
      ~ auto_init                               = false -> true
      + gitignore_template                      = "Python"
        id                                      = "snippets-golang-leetcode"
      + ignore_vulnerability_alerts_during_read = false
      + license_template                        = "agpl-3.0"
        name                                    = "snippets-golang-leetcode"
        # (33 unchanged attributes hidden)

      ~ security_and_analysis {
          ~ advanced_security {
              + status = "enabled"
            }

          ~ secret_scanning_push_protection {
              ~ status = "disabled" -> "enabled"
            }

            # (1 unchanged block hidden)
        }
    }

  # module.repositories["snippets-javascript-assignments"].github_repository.repository will be updated in-place
  ~ resource "github_repository" "repository" {
      + archive_on_destroy                      = true
      ~ auto_init                               = false -> true
      + gitignore_template                      = "Python"
        id                                      = "snippets-javascript-assignments"
      + ignore_vulnerability_alerts_during_read = false
      + license_template                        = "agpl-3.0"
        name                                    = "snippets-javascript-assignments"
      ~ topics                                  = [
          + "github-pages",
          - "snippets",
            # (6 unchanged elements hidden)
        ]
        # (32 unchanged attributes hidden)

      ~ security_and_analysis {
          ~ advanced_security {
              + status = "enabled"
            }

          ~ secret_scanning_push_protection {
              ~ status = "disabled" -> "enabled"
            }

            # (1 unchanged block hidden)
        }

        # (1 unchanged block hidden)
    }

  # module.repositories["template-repository-default"].github_repository.repository will be updated in-place
  ~ resource "github_repository" "repository" {
      + archive_on_destroy                      = true
      ~ auto_init                               = false -> true
      + gitignore_template                      = "Python"
        id                                      = "template-repository-default"
      + ignore_vulnerability_alerts_during_read = false
      + license_template                        = "agpl-3.0"
        name                                    = "template-repository-default"
      ~ topics                                  = [
          + "shields-io",
          + "shieldsio",
          + "template",
          + "template-project",
          + "template-repository",
            # (1 unchanged element hidden)
        ]
        # (32 unchanged attributes hidden)

      ~ security_and_analysis {
          ~ advanced_security {
              + status = "enabled"
            }

          ~ secret_scanning_push_protection {
              ~ status = "disabled" -> "enabled"
            }

            # (1 unchanged block hidden)
        }
    }

Plan: 4 to add, 18 to change, 0 to destroy.

```

</details>


Pushed by: @tiandaoburen
Action: `pull_request`
